app/controllers/admin/roles_controller.rb

SELECT `roles`.* FROM `roles` LIMIT 20 OFFSET 0
---
  def index
    @roles = Role.paginate(:page => params[:page], :per_page => 20)

SELECT `roles`.* FROM `roles` WHERE `roles`.`id` = 3 LIMIT 1
---
  def show
    @role = Role.find(params[:id])

SELECT `roles`.* FROM `roles` WHERE `roles`.`id` = 2 LIMIT 1
---
  def edit
    @role = Role.find(params[:id])

SELECT `roles`.* FROM `roles` WHERE `roles`.`id` = 1 LIMIT 1
SELECT `permissions`.* FROM `permissions`
---
  def permissions
    @role = Role.find(params[:id])
    @permissions_all = Permission.all