app/controllers/admin/users_controller.rb

SELECT `users`.* FROM `users` ORDER BY created_at desc LIMIT 20 OFFSET 0
---
  def index
    @users = User.order("created_at desc").paginate(:page => params[:page], :per_page => 20)

INSERT INTO `users` (`authentication_token`, `confirmation_sent_at`, `confirmation_token`, `confirmed_at`, `created_at`, `current_sign_in_at`, `current_sign_in_ip`, `email`, `encrypted_password`, `failed_attempts`, `is_activity`, `last_sign_in_at`, `last_sign_in_ip`, `locked_at`, `remember_created_at`, `reset_password_sent_at`, `reset_password_token`, `sign_in_count`, `unconfirmed_email`, `unlock_token`, `updated_at`, `username`) VALUES (NULL, NULL, NULL, '2013-01-30 08:52:35', '2013-01-30 08:52:36', NULL, NULL, 'ryan1@xiaoma.com', '$2a$10$kM9doMRmlUfSalq1wIk4xud.6F1r1xabE7dFFCMD8WvUG5z0pH.FW', 0, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, '2013-01-30 08:52:36', 'ryan1')
---
  def create
    @user = User.new(params[:user])
    # 手动验证 跳过验证,验证时间会被设定为当前创建的时间
    @user.skip_confirmation!
    if @user.save

DELETE FROM `users` WHERE `users`.`id` = 4
---
  def destroy
    if @user == current_user
      flash[:alert] = "你不能删除你自己!"
    else
      @user.destroy

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `roles`.* FROM `roles`
---
  def roles
    @user = User.find(params[:id])
    @roles_all = Role.all

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `roles`.* FROM `roles` WHERE `roles`.`id` = 3 LIMIT 1
---
  def assign_roles
    @user = User.find(params[:id])
    # 拿出此次得到角色数组
    role_ids = params[:role_ids]
    # 删除原来所有的关系
    @user.roles.delete(@user.roles)
    if not role_ids.nil?
      role_ids.each do |role_id|
        role = Role.find_by_id(role_id)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
  def find_user
    @user = User.find(params[:id])