app/views/traffic/main/index.html.erb

SELECT `tag_categories`.* FROM `tag_categories` WHERE (id NOT IN (1,2))
SELECT `web_pages`.* FROM `web_pages`
SELECT `positions`.* FROM `positions`
SELECT `campaigns`.* FROM `campaigns`
---
    日期: <input type="text" id="datepicker" name="start_date">
    分类: <%= select_tag(:category, options_for_select(TagCategory.where("id NOT IN (1,2)").all.collect { |p| [p.name, p.id]}), { :include_blank => true })%>
    页面: <%= select_tag(:web_page, options_for_select(WebPage.all.collect { |p| [p.content, p.id]}), { :include_blank => true })%>
    位置: <%= select_tag(:position, options_for_select(Position.all.collect { |p| [p.name, p.id]}), { :include_blank => true })%>
    活动: <%= select_tag(:campaign, options_for_select(Campaign.all.collect { |p| [p.name, p.id]}), { :include_blank => true })%>