app/views/traffic/main/search1.html.erb

    结束日期: <input type="text" id="datepicker1" name="end_date">
    分类: <%= select_tag(:category, options_for_select(TagCategory.where("id IN (1,2)").all.collect { |p| [p.name, p.id]}), { :include_blank => true })%>
---
SELECT `tag_categories`.* FROM `tag_categories` WHERE (id NOT IN (1,2))

    <td>
        <% if !click.page.nil? %>
---
SELECT `web_pages`.* FROM `web_pages` WHERE `web_pages`.`id` = 5 LIMIT 1

                        <% if !pos.position.nil? %>
                            <%= Position.find(pos.position).name %>
---
SELECT `positions`.* FROM `positions` WHERE `positions`.`id` = 15 LIMIT 1

                                    <% if !pos.campaign.nil? %>
                                        <%= Campaign.find(camp.campaign).name %>
---
SELECT `campaigns`.* FROM `campaigns` WHERE `campaigns`.`id` = 8 LIMIT 1