app/controllers/bbs/admin_controller.rb

SELECT COUNT(*) FROM `bbs_core_customers` WHERE (bbs_type=1) AND (`bbs_core_customers`.`current_date` BETWEEN '2013-01-28 16:00:00' AND '2013-01-29 16:00:00')
SELECT `bbs_core_customers`.* FROM `bbs_core_customers` WHERE (`bbs_core_customers`.`current_date` BETWEEN '2013-01-28 16:00:00' AND '2013-01-29 16:00:00') AND (bbs_type=1) LIMIT 20 OFFSET 0
---
  def index
    if !params[:start_date].nil?
      if !params[:start_date].empty?
        @t = DateTime.strptime(params[:start_date] + " CCT", "%Y-%m-%d")
        @time = @t.strftime("%Y-%m-%d")
        time_range = ((@t.midnight + 1.second) - 1.day)..@t.midnight
      else
        time_range = (Time.now.midnight - 1.day)..Time.now.midnight
      end
    else
      time_range = (Time.now.midnight - 1.day)..Time.now.midnight
    end

    @customers = BbsCoreCustomer.where('current_date' => time_range).where("bbs_type=1").paginate(:page => params[:page], :per_page => 20)