app/controllers/editor/main_controller.rb

SELECT `google_analytics`.* FROM `google_analytics` ORDER BY id desc LIMIT 20 OFFSET 0
---
	def index
		@google_analytics = GoogleAnalytic.order("id desc").paginate(:page => params[:page], :per_page => 20)