app/views/task/main/me.html.erb

		<% @dailies.group('user_id').each do |daily0|%>
		<% @dailies.where("user_id=#{daily0.user_id}").each do |daily|%>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1