app/controllers/task/daily_tasks_controller.rb

SELECT `daily_tasks`.* FROM `daily_tasks`
---
    def index
        @daily_tasks = DailyTask.all