app/controllers/task/daily_tasks_controller.rb

SELECT `daily_tasks`.* FROM `daily_tasks` WHERE `daily_tasks`.`user_id` = 1 AND ((plan_start_timeline >='2013-02-20 00:00:00' AND plan_start_timeline < '2013-02-21 00:00:00')
---
    def index
        @today = Time.now.midnight + 8.hours#(Time.now.beginning_of_day)
        @tomorrow = Time.now.midnight + 1.day + 8.hours #(Time.now.end_of_day)
        @today0 = Time.now.midnight + 8.hours - 1.day #(Time.now.beginning_of_day)
        @tomorrow1 = Time.now.midnight + 2.day + 8.hours #(Time.now.end_of_day)

        @daily_tasks = DailyTask.where(
            "(plan_start_timeline >=? AND plan_start_timeline < ?)
            OR
            (plan_finish_timeline >=? AND plan_finish_timeline <?)
            OR
            (plan_start_timeline <? AND plan_finish_timeline >=?)",
            @today, @tomorrow, @today, @tomorrow, @today, @tomorrow).group('user_id')

SELECT `daily_tasks`.* FROM `daily_tasks` ORDER BY plan_finish_timeline DESC LIMIT 20 OFFSET 0
---
    def all
        @daily_tasks = DailyTask.order('plan_finish_timeline DESC').paginate(:page => params[:page], :per_page => 20)

SELECT `daily_tasks`.* FROM `daily_tasks` WHERE `daily_tasks`.`id` = 8 LIMIT 1
---
    def show
        @refer = request.referer
        @daily_task = DailyTask.find(params[:id])

SELECT `daily_tasks`.* FROM `daily_tasks` WHERE `daily_tasks`.`id` = 8 LIMIT 1
---
    def edit
    @daily_task = DailyTask.find(params[:id])

INSERT INTO `daily_tasks` (`accomplishment`, `content`, `created_at`, `plan_finish_timeline`, `plan_start_timeline`, `status`, `title`, `updated_at`, `url`, `user_id`) VALUES (0, '', '2013-01-30 08:24:34', '2013-01-30 08:47:00', '2013-01-30 08:24:00', NULL, '完成解锁上锁', '2013-01-30 08:24:34', NULL, 1)
---
    def create
        date1 = DateTime.strptime(params[:daily_task]['plan_start_timeline'] + " CCT", "%Y-%m-%d %H:%M %Z")
        date2 = DateTime.strptime(params[:daily_task]['plan_finish_timeline'] + " CCT", "%Y-%m-%d %H:%M %Z")
        params[:daily_task]['plan_start_timeline'] = date1

        @daily_task = DailyTask.new(params[:daily_task])

        respond_to do |format|
          if @daily_task.save

SELECT `daily_tasks`.* FROM `daily_tasks` WHERE `daily_tasks`.`id` = 8 LIMIT 1
UPDATE `daily_tasks` SET `plan_start_timeline` = '2013-01-30 22:00:00', `plan_finish_timeline` = '2013-01-31 04:40:00', `accomplishment` = 30, `content` = '123', `updated_at` = '2013-01-31 02:40:14' WHERE `daily_tasks`.`id` = 8
---
    def update
    @daily_task = DailyTask.find(params[:id])

    respond_to do |format|
      if @daily_task.update_attributes(params[:daily_task])