app/controllers/task/main_controller.rb

SELECT `daily_tasks`.* FROM `daily_tasks` WHERE `daily_tasks`.`user_id` = 1 AND ((plan_start_timeline >='2013-02-21 00:00:00' AND plan_finish_timeline >= '2013-02-20 00:00:00')
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
---
	def me
		@today0 = Time.now.midnight + 8.hours - 1.day
		@today = Time.now.midnight + 8.hours#(Time.now.beginning_of_day)
		@tomorrow = Time.now.midnight + 1.day + 8.hours #(Time.now.end_of_day)
		@tomorrow1 = Time.now.midnight + 2.day + 8.hours
		time_range = (Time.now.midnight - 1.day + 8.hours)..(Time.now.midnight+ 8.hours)


		@dailies = User.find(current_user.id).daily_tasks
		.where(
			"(plan_start_timeline >=? AND plan_start_timeline < ?)
			OR
			(plan_finish_timeline >=? AND plan_finish_timeline <?)
			OR
			(plan_start_timeline <? AND plan_finish_timeline >=?)",
			@today, @tomorrow, @today, @tomorrow, @today, @tomorrow)