app/views/clicks/index.html.erb

SELECT `tag_categories`.* FROM `tag_categories` WHERE `tag_categories`.`id` = 10 LIMIT 1
SELECT `web_pages`.* FROM `web_pages`
SELECT `positions`.* FROM `positions`
SELECT `campaigns`.* FROM `campaigns`
---
    日期: <input type="text" id="datepicker" name="start_date">
    分类: <%= select_tag(:category, options_for_select(TagCategory.where("id NOT IN (1,2)").all.collect { |p| [p.name, p.id]}), { :include_blank => true })%>
    页面: <%= select_tag(:web_page, options_for_select(WebPage.all.collect { |p| [p.content, p.id]}), { :include_blank => true })%>
    位置: <%= select_tag(:position, options_for_select(Position.all.collect { |p| [p.name, p.id]}), { :include_blank => true })%>
    活动: <%= select_tag(:campaign, options_for_select(Campaign.all.collect { |p| [p.name, p.id]}), { :include_blank => true })%>

SELECT `web_pages`.* FROM `web_pages` WHERE `web_pages`.`id` = 15 LIMIT 1
---
    <td>
      <% if click.page.nil? %>

SELECT `positions`.* FROM `positions` WHERE `positions`.`id` = 8 LIMIT 1
---
          <%else%>
            <%= Position.find(page.position).name %>

SELECT `campaigns`.* FROM `campaigns` WHERE `campaigns`.`id` = 13 LIMIT 1
---
          <%else%>
            <%= Campaign.find(page.campaign).name %>