app/views/clicks/index_campaign.html.erb

    日期: <input type="text" id="datepicker" name="start_date">
    分类: <%= select_tag(:category, options_for_select(TagCategory.where("id NOT IN (1,2)").all.collect { |p| [p.name, p.id]}), { :include_blank => true })%>
---
SELECT `tag_categories`.* FROM `tag_categories` WHERE `tag_categories`.`id` = 12 LIMIT 1

      <%else%>
        <%= Campaign.find(click.campaign).name %>
---
SELECT `campaigns`.* FROM `campaigns` WHERE `campaigns`.`id` = 10 LIMIT 1

  <table border="0" cellpadding="0" cellspacing="0" width="680px;">
    <% @cams.where("page = #{click.page}").each do |page|%>
---
SELECT `web_pages`.* FROM `web_pages` WHERE `web_pages`.`id` = 15 LIMIT 1

          <%else%>
            <%= Position.find(page.position).name %>
---
SELECT `positions`.* FROM `positions` WHERE `positions`.`id` = 28 LIMIT 1