app/views/admin/roles/show.html.erb

SELECT `permissions`.* FROM `permissions` INNER JOIN `roles_permissions` ON `permissions`.`id` = `roles_permissions`.`permission_id` WHERE `roles_permissions`.`role_id` = 3
---
							<div>权限:
								<% @role.permissions.each do |permisson| %>