app/controllers/traffic/main_controller.rb

SELECT SUM(`clicks`.`clicks`) AS sum_id FROM `clicks` WHERE (`clicks`.`record_date` BETWEEN '2013-01-28 16:00:00' AND '2013-01-29 16:00:00')
SELECT `clicks`.* FROM `clicks` WHERE (`clicks`.`record_date` BETWEEN '2013-01-28 16:00:00' AND '2013-01-29 16:00:00') GROUP BY page LIMIT 20 OFFSET 0
---
	def index
	    time_range = (Time.now.midnight - 1.day)..Time.now.midnight
	    @clicks = Click.where('record_date' => time_range).paginate(:page => params[:page], :per_page => 20).group("page")

SELECT *, sum(clicks) as total_clicks FROM `clicks` WHERE (`clicks`.`record_date` BETWEEN '2013-02-02 16:00:00' AND '2013-02-03 16:00:00') GROUP BY position ORDER BY total_clicks DESC
SELECT SUM(`clicks`.`clicks`) AS sum_id FROM `clicks` WHERE (`clicks`.`record_date` BETWEEN '2013-02-02 16:00:00' AND '2013-02-03 16:00:00')
---
  def search
    if params[:start_date] && params[:end_date]
      if params[:start_date].strip.empty? && params[:end_date].strip.empty?
        @time_range = (Time.now.midnight - 1.day)..Time.now.midnight
      else
        @t = DateTime.strptime(params[:start_date] + " CCT", "%Y-%m-%d")
        @t1 = DateTime.strptime(params[:end_date] + " CCT", "%Y-%m-%d")
        @time = @t.strftime("%Y-%m-%d")
        @time1 = @t1.strftime("%Y-%m-%d")
        @time_range = @time..@time1
      end
    else
      @time_range = (Time.now.midnight - 1.day)..Time.now.midnight
    end

    @clicks = Click.where('record_date' => @time_range).group("position").select("*, sum(clicks) as total_clicks").order("total_clicks DESC");
    @click_count = Click.where('record_date' => @time_range).sum(:clicks)

SELECT `tag_categories`.* FROM `tag_categories` WHERE (id NOT IN (1,2))
---
    # end

    if params[:category]
      if !params[:category].empty?

SELECT *, sum(clicks) as total_clicks FROM `clicks` WHERE (`clicks`.`record_date` BETWEEN '2013-02-01' AND '2013-02-04') AND ( 1=1 and up_category = 2) GROUP BY page ORDER BY total_clicks DESC
SELECT *, sum(clicks) as total_camp_clicks FROM `clicks` WHERE (`clicks`.`record_date` BETWEEN '2013-01-01' AND '2013-02-04') AND ( 1=1 and category = 2) AND (position = 28 and page=1) GROUP BY campaign ORDER BY total_camp_clicks DESC
SELECT SUM(`clicks`.`clicks`) AS sum_id FROM `clicks` WHERE (`clicks`.`record_date` BETWEEN '2013-02-01' AND '2013-02-04') AND ( 1=1 and up_category = 2)
---
    #   format.json { render json: @clicks }
    # end

    @clicks = Click.where('record_date' => @time_range).where(conditions).group("page").select("*, sum(clicks) as total_clicks").order("total_clicks DESC");
    @click_count = Click.where('record_date' => @time_range).where(conditions).sum(:clicks)