app/controllers/calendar_controller.rb

SELECT `daily_tasks`.* FROM `daily_tasks` WHERE `daily_tasks`.`user_id` = 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
	def index
		 @tasks = User.find(current_user.id).daily_tasks