app/controllers/clicks_controller.rb

  def index
    time_range = (Time.now.midnight - 1.day)..Time.now.midnight
    @clicks = Click.where('record_date' => time_range).paginate(:page => params[:page], :per_page => 20).group("page")
---
SELECT SUM(`clicks`.`clicks`) AS sum_id FROM `clicks` WHERE (`clicks`.`record_date` BETWEEN '2012-12-27 16:00:00' AND '2012-12-28 16:00:00')
SELECT `clicks`.* FROM `clicks` WHERE (`clicks`.`record_date` BETWEEN '2012-12-27 16:00:00' AND '2012-12-28 16:00:00') GROUP BY page LIMIT 20 OFFSET 0

  def index_campaign
    time_range = (Time.now.midnight - 1.day)..Time.now.midnight
    @clicks = Click.where('record_date' => time_range).group("campaign")
    @click_count = Click.where('record_date' => time_range).sum(:clicks)
---
SELECT SUM(`clicks`.`clicks`) AS sum_id FROM `clicks` WHERE (`clicks`.`record_date` BETWEEN '2012-12-27 16:00:00' AND '2012-12-28 16:00:00')
SELECT `clicks`.* FROM `clicks` WHERE (`clicks`.`record_date` BETWEEN '2012-12-27 16:00:00' AND '2012-12-28 16:00:00') GROUP BY campaign
SELECT COUNT(*) AS count_all, campaign AS campaign FROM `clicks` WHERE (`clicks`.`record_date` BETWEEN '2012-12-27 16:00:00' AND '2012-12-28 16:00:00') GROUP BY campaign

  def sum_campaign
    if params[:start_date] && params[:end_date]
      if params[:start_date].strip.empty? && params[:end_date].strip.empty?
        time_range = (Time.now.midnight - 1.day)..Time.now.midnight
      else
        @t = DateTime.strptime(params[:start_date] + " CCT", "%Y-%m-%d")
        @t1 = DateTime.strptime(params[:end_date] + " CCT", "%Y-%m-%d")
        @time = @t.strftime("%Y-%m-%d")
        @time1 = @t1.strftime("%Y-%m-%d")
        time_range = @time..@time1
        # @all = "select a.*, b.* From (SELECT *, sum(clicks) as sum_campaign FROM `clicks` GROUP BY campaign) a JOIN `campaigns` b ON a.campaign = b.id;";
      end
    else
      time_range = (Time.now.midnight - 1.day)..Time.now.midnight
    end
    @all = Click.where('record_date' => time_range).select("*, sum(clicks) as sum_campaign").group("campaign").order("sum_campaign DESC")
---
SELECT *, sum(clicks) as sum_campaign FROM `clicks` WHERE (`clicks`.`record_date` BETWEEN '2012-12-27 16:00:00' AND '2012-12-28 16:00:00') GROUP BY campaign ORDER BY sum_campaign DESC

  def sum_position
    if params[:start_date] && params[:end_date]
      if params[:start_date].strip.empty? && params[:end_date].strip.empty?
        time_range = (Time.now.midnight - 1.day)..Time.now.midnight
      else
        @t = DateTime.strptime(params[:start_date] + " CCT", "%Y-%m-%d")
        @t1 = DateTime.strptime(params[:end_date] + " CCT", "%Y-%m-%d")
        @time = @t.strftime("%Y-%m-%d")
        @time1 = @t1.strftime("%Y-%m-%d")
        time_range = @time..@time1
      end
    else
      time_range = (Time.now.midnight - 1.day)..Time.now.midnight
    end
    @all = Click.where('record_date' => time_range).select("*, sum(clicks) as sum_position").group("position").order("sum_position DESC")
---
SELECT *, sum(clicks) as sum_position FROM `clicks` WHERE (`clicks`.`record_date` BETWEEN '2012-12-27 16:00:00' AND '2012-12-28 16:00:00') GROUP BY position ORDER BY sum_position DESC

  def sum_category
    if params[:start_date] && params[:end_date]
      if params[:start_date].strip.empty? && params[:end_date].strip.empty?
        time_range = (Time.now.midnight - 1.day)..Time.now.midnight
      else
        @t = DateTime.strptime(params[:start_date] + " CCT", "%Y-%m-%d")
        @t1 = DateTime.strptime(params[:end_date] + " CCT", "%Y-%m-%d")
        @time = @t.strftime("%Y-%m-%d")
        @time1 = @t1.strftime("%Y-%m-%d")
        time_range = @time..@time1
      end
    else
      time_range = (Time.now.midnight - 1.day)..Time.now.midnight
    end
    @all = Click.where('record_date' => time_range).select("*, sum(clicks) as sum_category").group("category").order("sum_category DESC")
---
SELECT *, sum(clicks) as sum_category FROM `clicks` WHERE (`clicks`.`record_date` BETWEEN '2012-12-27 16:00:00' AND '2012-12-28 16:00:00') GROUP BY category ORDER BY sum_category DESC

  def sum_child_category
    if params[:start_date] && params[:end_date]
      if params[:start_date].strip.empty? && params[:end_date].strip.empty?
        time_range = (Time.now.midnight - 1.day)..Time.now.midnight
      else
        @t = DateTime.strptime(params[:start_date] + " CCT", "%Y-%m-%d")
        @t1 = DateTime.strptime(params[:end_date] + " CCT", "%Y-%m-%d")
        @time = @t.strftime("%Y-%m-%d")
        @time1 = @t1.strftime("%Y-%m-%d")
        time_range = @time..@time1
      end
    else
      time_range = (Time.now.midnight - 1.day)..Time.now.midnight
    end
    @all = Click.where('record_date' => time_range).select("*, sum(clicks) as sum_category").group("up_category").order("sum_category DESC")
---
SELECT *, sum(clicks) as sum_category FROM `clicks` WHERE (`clicks`.`record_date` BETWEEN '2012-12-27 16:00:00' AND '2012-12-28 16:00:00') GROUP BY up_category ORDER BY sum_category DESC

  def referral_traffic
    # time_range = (Time.now.midnight - 1.day)..Time.now.midnight
    # @triffs = ReferralTraffic.where('current_date' => time_range).order("clicks DESC")
    # @count_triffs = ReferralTraffic.where('current_date' => time_range).sum('clicks')
    # respond_to do |format|
    #   format.html
    #   format.json { @triffs }
    # end

    if !params[:start_date].nil?
      if !params[:start_date].empty?
        @t = DateTime.strptime(params[:start_date] + " CCT", "%Y-%m-%d")
        @time = @t.strftime("%Y-%m-%d")
        time_range = ((@t.midnight + 1.second) - 1.day)..@t.midnight
      else
        time_range = (Time.now.midnight - 1.day)..Time.now.midnight
      end
    else
      time_range = (Time.now.midnight - 1.day)..Time.now.midnight
    end

    @triffs = ReferralTraffic.where('current_date' => time_range).order("clicks DESC")
---
SELECT SUM(`referral_traffics`.`clicks`) AS sum_id FROM `referral_traffics` WHERE (`referral_traffics`.`current_date` BETWEEN '2012-12-27 16:00:00' AND '2012-12-28 16:00:00')
SELECT `referral_traffics`.* FROM `referral_traffics` WHERE (`referral_traffics`.`current_date` BETWEEN '2012-12-27 16:00:00' AND '2012-12-28 16:00:00') ORDER BY clicks DESC

  def organic_traffic
    if !params[:start_date].nil?
      if !params[:start_date].empty?
        @t = DateTime.strptime(params[:start_date] + " CCT", "%Y-%m-%d")
        @time = @t.strftime("%Y-%m-%d")
        time_range = ((@t.midnight + 1.second) - 1.day)..@t.midnight
      else
        time_range = (Time.now.midnight - 1.day)..Time.now.midnight
      end
    else
      time_range = (Time.now.midnight - 1.day)..Time.now.midnight
    end

    @triffs = OrganicTraffic.where('current_date' => time_range).order("clicks DESC").paginate(:page => params[:page], :per_page => 50)
---
SELECT SUM(`organic_traffics`.`clicks`) AS sum_id FROM `organic_traffics` WHERE (`organic_traffics`.`current_date` BETWEEN '2012-12-27 16:00:00' AND '2012-12-28 16:00:00')
SELECT `organic_traffics`.* FROM `organic_traffics` WHERE (`organic_traffics`.`current_date` BETWEEN '2012-12-27 16:00:00' AND '2012-12-28 16:00:00') ORDER BY clicks DESC LIMIT 50 OFFSET 0