app/controllers/google_analytics_controller.rb

SELECT `google_analytics`.* FROM `google_analytics` ORDER BY id desc LIMIT 20 OFFSET 0
---
  def user_index
    @google_analytics = GoogleAnalytic.order("id desc").paginate(:page => params[:page], :per_page => 20)

SELECT `google_traffic_rankings`.* FROM `google_traffic_rankings` WHERE (`current_date`='2012-12-28' and channel_type='4') ORDER BY visits desc
---
  def show_traffic
    @traffic = GoogleTrafficRanking.where("`current_date`=? and channel_type=?",params[:dt],params[:t]).order("visits desc")