app/controllers/positions_controller.rb

  def index
    @positions = Position.order("created_at desc").paginate(:page => params[:page], :per_page => 20)
---
SELECT COUNT(*) FROM `positions`
SELECT `positions`.* FROM `positions` ORDER BY created_at desc LIMIT 20 OFFSET 0