app/controllers/tag_categories_controller.rb

  def index
    @tag_categories = TagCategory.order("created_at desc").paginate(:page => params[:page], :per_page => 20)
---
SELECT `tag_categories`.* FROM `tag_categories` ORDER BY created_at desc LIMIT 20 OFFSET 0

  def detail
    @category = TagCategory.find(params[:id])
    if params[:start_date].nil?
      time_range = (Time.now.midnight - 1.day)..Time.now.midnight
    else
      @t = DateTime.strptime(params[:start_date] + " CCT", "%Y-%m-%d")
      time_range = (@t.midnight - 1.day + 1.second)..@t.midnight
    end
    @cat_id = params[:id]
    print "--------------#{[1,2].include?@cat_id }"
    if ['1','2'].include?@cat_id
      @clicks = Click.where('record_date' => time_range).where("category = #{params[:id]}").paginate(:page => params[:page], :per_page => 10)
---
SELECT `tag_categories`.* FROM `tag_categories` WHERE `tag_categories`.`id` = 2 LIMIT 1
SELECT SUM(`clicks`.`clicks`) AS sum_id FROM `clicks` WHERE (`clicks`.`record_date` BETWEEN '2012-12-27 16:00:00' AND '2012-12-28 16:00:00') AND (category = 2)
SELECT `clicks`.* FROM `clicks` WHERE (`clicks`.`record_date` BETWEEN '2012-12-27 16:00:00' AND '2012-12-28 16:00:00') AND (category = 1) LIMIT 10 OFFSET 0