app/controllers/web_pages_controller.rb

SELECT COUNT(*) FROM `web_pages`
SELECT `web_pages`.* FROM `web_pages` ORDER BY created_at desc LIMIT 20 OFFSET 0
---
  def index
    @web_pages = WebPage.order("created_at desc").paginate(:page => params[:page], :per_page => 20)