app/views/admin/users/show.html.erb

SELECT `roles`.* FROM `roles` INNER JOIN `users_roles` ON `roles`.`id` = `users_roles`.`role_id` WHERE `users_roles`.`user_id` = 4
---
							<div>角色:
								<% @user.roles.each do |role| %>